package com.example.nityaaarti

object AartiRepository {

    fun getAartiLyrics(aartiName: String): String {
        return when (aartiName) {
            "सुखकर्ता दुःखहर्ता" -> """
                सुखकर्ता दुःखहर्ता वार्ता विघ्नाची ।
                नुरवी पुरवी प्रेम कृपा जयाची ।
                सर्वांगी सुंदर उटी शेंदुराची ।
                कंठी झळके माळ मुक्ताफळांची ।।१।।
                
                जय देव जय देव जय मंगलमूर्ति ।
                दर्शनमात्रे मनःकामना पुरती ।।धृ०।।

                रत्नखचित फरा तुज गौरीकुमरा ।
                चंदनाची उटी कुंकुमकेशरा ।
                हिरेजडित मुकुट शोभतो बरा ।
                रुणझुणती नूपुरे चरणीं घागरिया ।।२।।
                
                जय देव जय देव जय मंगलमूर्ति ।
                दर्शनमात्रे मनःकामना पुरती ।।धृ०।।

                लंबोदर पीतांबर फणिवरबंधना ।
                सरळ सोंड वक्रतुंड त्रिनयना ।
                दास रामाचा वाट पाहे सदना ।
                संकटी पावावे, निर्वाणी रक्षावे सुरवरवंदना ।।३।।
                
                जय देव जय देव जय मंगलमूर्ति ।
                दर्शनमात्रे मनःकामना पुरती ।।धृ०।।
            """.trimIndent()

            "शेंदुर लाल चढ़ायो" -> """
                 शेंदुर लाल चढ़ायो अच्छा गजमुखको ।
                 दोंदिल लाल बिराजे सुत गौरिहरको ।
                 हाथ लिए गुडलद्दु सांई सुरवरको ।
                 महिमा कहे न जाय लागत हूं पादको ।।१।।

                 जय जय श्री गणराज विद्या सुखदाता ।
                 धन्य तुम्हारा दर्शन मेरा मन रमता ।।धृ०।।

                 अष्टौ सिद्धि दासी संकटको बैरि । 
                 विघ्नविनाशन मंगल मूरत अधिकारी ।
                 कोटीसूरजप्रकाश ऐबी छबि तेरी ।
                 गंडस्थलमदमस्तक झूले शशिबिहारी ।।२।।

                 जय जय श्री गणराज विद्या सुखदाता ।
                 धन्य तुम्हारा दर्शन मेरा मन रमता ।।धृ०।।

                 भावभगत से कोई शरणागत आवे ।
                 संतत संपत सबही भरपूर पावे ।
                 ऐसे तुम महाराज मोको अति भावे ।
                 गोसावीनंदन निशिदिन गुन गावे ।।३।।

                 जय जय श्री गणराज विद्या सुखदाता ।
                 धन्य तुम्हारा दर्शन मेरा मन रमता ।।धृ०।।
            """.trimIndent()

            "नाना परिमळ" -> """
                 नाना परिमळ दुर्वा शेंदुर शमिपत्रें । 
                 लाडू मोदक अन्ने परिपूरित पात्रें ।
                 ऐसें पूजन केल्या बीजाक्षर मंत्रें । 
                 अष्टहि सिद्धि नवनिधि देसी क्षणमात्रें ।।१।।
                 
                 जय देव जय देव जय मंगलमूर्ति । 
                 तुझे गुण वर्णाया मज कैंची स्फुर्ती ।।धृ०।।

                 तुझे ध्यान निरंतर जे कोणी करिती । 
                 त्यांचीं सकलहि पापें विघ्नेंही हरती ।
                 वाजी वारण शिबिका सेवक सुत युवती । 
                 सर्वहि पावुनि अंतीं भवसागर तरती ।।२।।
                 
                 जय देव जय देव जय मंगलमूर्ति । 
                 तुझे गुण वर्णाया मज कैंची स्फुर्ती ।।धृ०।।

                 शरणागत सर्वस्वें भजती तव चरणीं । 
                 किर्ति तयांची राहे जोवर शशितरणी ।
                 त्रैलोक्यीं ते विजयी अद्भुत हे करणी । 
                 गोसावीनंदन रत नामस्मरणीं ।।३।।
                 
                 जय देव जय देव जय मंगलमूर्ति । 
                 तुझे गुण वर्णाया मज कैंची स्फुर्ती ।।धृ०।।
            """.trimIndent()

            "लवथवती विक्राळा" -> """
                 लवथवती विक्राळा ब्रह्मांडी माळा ।
                 विषें कंठ काळा त्रिनेत्री ज्वाला ।
                 लावण्यसुंदर मस्तकी बाळा ।
                 तेथुनिया जळ निर्मल वाहे झुळझुळां ।।१।।
                 
                 जय देव जय देव जय श्रीशंकरा ।
                 आरती ओवाळू तुज कर्पुरगौरा ।।धृ०।।

                 कर्पुरगौरा भोळा नयनी विशाळा ।
                 अर्धांगी पार्वती सुमनांच्या माळा ।
                 विभूतीचे उधळण शीत कंठ निळां ।
                 ऐसा शंकर शोभे उमावेल्हाळा ।।२।।
                 
                 जय देव जय देव जय श्रीशंकरा ।
                 आरती ओवाळू तुज कर्पुरगौरा ।।धृ०।।

                 देवीं दैत्यीं सागरमंथन पैं केलें ।
                 त्यामाजी अवचित हलाहल जें उठिलें ।
                 ते त्वां असुरपणे प्रशान केलें ।
                 नीलकंठ नाम प्रसिद्ध झालें ।।३।।
                 
                 जय देव जय देव जय श्रीशंकरा ।
                 आरती ओवाळू तुज कर्पुरगौरा ।।धृ०।।

                 व्याघ्रांबर फणिवरधर सुंदर मदनारी ।
                 पंचानन मनमोहन मुनिजन सुखकारी ।
                 शतकोटीचे बीज वाचे उच्चारी ।
                 रघुकुळटिळक रामदास अंतरीं ।।४।।
                 
                 जय देव जय देव जय श्रीशंकरा ।
                 आरती ओवाळू तुज कर्पुरगौरा ।।धृ०।।
            """.trimIndent()

            "सदया सगुणा शंभो अजिनांबरधारी" -> """
                 सदया सगुणा शंभो अजिनांबरधारी ।
                 गौरीरमणा आद्या मदनांतकारी ।
                 त्रिपुरारी अधहारी शिवमस्तकधारी ।
                 विश्वंभर विरुदे हैं नम संकट धारीं ।।१।।
                 
                 जय देव जय देव श्रीमंगेशा ।
                 पंचारति ओवाळू सदया सर्वेशा ।।धृ०।।
                 
                 भयकृत भयनाशन ही नामें तुज देवा ।
                 विबुधादिक कमळासन वांछिती तव सेवा ।
                 तुझे गुण वर्णाया वाटतसे हेवा ।
                 अभिनव कृपाकटाक्षं मतिउत्सव द्यावा ।।२।।
                 
                 जय देव जय देव श्रीमंगेशा ।
                 पंचारति ओवाळू सदया सर्वेशा ।।धृ०।।
                 
                 शिव शिव जपता शिव तू करिसी निजदासा ।
                 संकट वारी मम तूं करी शत्रुविनाशा ।
                 कुळवृद्धीते पाववी हीच असे आशा ।
                 अनंतसुत वांछितसे चरणांबुजलेशा ।।३।।
                           
                 जय देव जय देव श्रीमंगेशा ।
                 पंचारति ओवाळू सदया सर्वेशा ।।धृ०।। 
            """.trimIndent()

            "पडलें गोहत्येचें पातक गौतमऋषिच्या शिरी हो" -> """
                पडलें गोहत्येचें पातक गौतमऋषिच्या शिरी हो ।
                त्याने तप मांडिले ध्याना आणुनि तुज अंतरी हो ।
                प्रसन्न होऊनि त्यातें स्नाना दिधली गोदावरी हो ।
                औदुंबरमुळी प्रगटे पावन त्रैलोक्यातें करी हो ।।१।।
            
                जय जय त्र्यंबकराज गिरिजानाथा गंगाधरा हो ।
                त्रिशूल पाणी शंभो नीलग्रीवा शशिशेखरा हो ।।धृ०।।
            
                धन्य कुशावर्ताचा महिमा वाचे वर्ण किती हो ।
                आणिकही बहुतीतें गंगाद्वारादिक पर्वती हो ।
                वंदन मार्जन करिती त्याचे महादोष नासती हो ।
                तुझिया दर्शनमात्रे प्राणी मुक्तीतें पावती हो ।।२।।
            
                जय जय त्र्यंबकराज गिरिजानाथा गंगाधरा हो ।
                त्रिशूल पाणी शंभो नीलग्रीवा शशिशेखरा हो ।।धृ०।।
            
                ब्रह्मगिरींची भावें ज्याला प्रदक्षिणा जरी घडे हो ।
                तैं ते काया कष्टें जंव जंव चरणी रुपती खडे हो ।
                तंव तंव पुण्य विशेष किल्मिष अवघे त्याचें झडे हो ।
                केवळ तो शिवरुपी काळ त्याच्या पाया पडे हो ।।३।।
            
                जय जय त्र्यंबकराज गिरिजानाथा गंगाधरा हो ।
                त्रिशूल पाणी शंभो नीलग्रीवा शशिशेखरा हो ।।धृ०।।
            
                लावूनिया निजभजनी सकळही पुरविसी मनकामना हो ।
                संतति संपत्ति देसी अंती चुकविसी यमयातना हो ।
                शिव शिव नाम जपता वाटे आनंद माझ्या मना हो ।
                गोसावीनंदन विसरे संसारयातना हो ।।४।।
                
                जय जय त्र्यंबकराज गिरिजानाथा गंगाधरा हो ।
                त्रिशूल पाणी शंभो नीलग्रीवा शशिशेखरा हो ।।धृ०।।
            """.trimIndent()


            "दुर्गे दुर्घट भारी" -> """
                दुर्गे दुर्घटभारी तुजवीण संसारी ।
                अनाथ नाथे अम्बे करुणाविस्तारी ।
                वारी वारी जन्म मरणांते वारी ।
                हारी पडलो आता संकट नेवारी ।।१।।
            
                जय देवी जय देवी महिषासुरमथिनि ।
                सुरवर ईश्वर वरदे तारकसंजीवनी ।।धृ०।।
            
                तुजवीण भुवनी पाहता तुज ऐसे नाही ।
                चारी श्रमले परंतु न बोलवे काही ।
                साही विवाद करिता पडले प्रवाही ।
                ते तू भक्तालागी पावसि लवलाही ।।२।।
            
                जय देवी जय देवी महिषासुरमथिनि ।
                सुरवर ईश्वर वरदे तारकसंजीवनी ।।धृ०।।
            
                प्रसन्न वदने प्रसन्न होसी निजदासा ।
                क्लेशांपासुनी सोडवी तोडी भवपाशा ।
                अम्बे तुजवाचून् कोण पुरवील् आशा ।
                नरहरी तल्लीन झाला पदपंकजलेशा ।।३।।
            
                जय देवी जय देवी महिषासुरमथिनि ।
                सुरवर ईश्वर वरदे तारकसंजीवनी ।।धृ०।।
            """.trimIndent()

            "उंदरावर बैसोनी दुड्डा येसी" -> """
                उंदरावर बैसोनी दुड्डा येसी ।
                हाती मोदक लाडू घेउनियां खासी ।।धृ०।।
             
                भक्तांचे संकटी घावनियां पावसी ।
                दास विनवीती तुझिया चरणांसी ।
                जय देव जय देव जय गणराया ।
                सकळ देवांआधीं तूं देव माझा जय देव ।।१।।
             
                भाद्रपदमार्सी होसी तू भोळा ।
                आरक्त पुष्पांच्या घालुनियां माळा ।
                कपाळी लावुनि कस्तुरी टिळा ।
                तेणे तू दिससी सुंदर सावळा जय देव ।।२।।
             
                प्रदोषांचे दिवशी चंद्रशापिला ।
                समर्थी देव मोठा आकांत केला ।
                इंद येवोनी चरण लागला ।
                श्रीरामा बहुत शाप दिधला जय ।।३।।
             
                पार्वतीच्या सूता तू ये गणनाथा ।
                नेत्र शिणले तुझी वाट पाहतां ।
                किती अंत पाहसी बा विघ्नहर्ता ।
                गजला बुध्दी देईतूं गणनाथा जय ।।४।।
            """.trimIndent()

            "तू सुखकर्ता तू दुःखहर्ता विघ्न विनाशक मोरया" -> """
                तू सुखकर्ता तू दुःखहर्ता विघ्‍न विनाशक मोरया ।
                संकटी रक्षी शरण तुला मी, गणपती बाप्पा मोरया ।।धृ०।।
             
                मंगलमूर्ती तू गणनायक, वक्रतुंड तू सिद्धिविनायक ।
                तुझिया द्वारी आज पातलो, ये इच्छित मज द्याया ।।१।।
             
                तू सकलांचा भाग्य विधाता, तू विद्येचा स्वामी दाता ।
                ज्ञानदीप उजळून आमुचा निमवी नैराश्याला ।।२।।
             
                तू माता तू पिता जगी या, ज्ञाता तू सर्वस्व जगी या ।
                पामर मी, स्वर उणे भासती तुझी आरती गाया ।।३।।
            """.trimIndent()

            "सत्राणे उड्डाणे हुंकार वदनी" -> """
                सत्राणे उड्डाणे हुंकार वदनी । 
                करि डळमळ भूमंडळ सिंधूजळ गगनी ।
                गडबडिले ब्रह्मांड धाके त्रिभुवनी ।
                सुरवर नर निशाचर त्या झाल्या पळणी ।।१।।
             
                जय देव जय देव जय हनुमंता । 
                तुमचे नि प्रसादे न भी कृतांता ।।धृ०।।
             
                दुमदुमिली पाताळे उठिला प्रतिशब्द ।
                थरथरला धरणीधर मानीला खेद ।
                कडकडिले पर्वत उड्डगण उच्छेद ।
                रामी रामदासा शक्तीचा बोध ।।२।।
                
                जय देव जय देव जय हनुमंता । 
                तुमचे नि प्रसादे न भी कृतांता ।।धृ०।।
            """.trimIndent()

            "त्रिगुणात्मक त्रैमूर्ती" -> """
                त्रिगुणात्मक त्रैमूर्ती दत्त हा जाणा ।
                त्रिगुणी अवतार त्रैलोक्य-राणा ।
                नेति नेति शब्दें न ये अनुमाना ।
                सुरवरमुनिजनयोगिसमाधि न ये ध्याना ।।१।।
             
                जयदेव जयदेव जय श्रीगुरुदत्ता । 
                आरती ओंवाळितां हरली भवचिंता ।।धृ०।।
             
                सबाह्य अभ्यंतरीं तूं एक दत्त । 
                अभाग्यासी कैची कळेल ही मात ।
                पराहि परतलि तेथें कैचा हा हेत ।
                जन्म मरणाचा पुरलासे अंत ।।२।।
                
                जयदेव जयदेव जय श्रीगुरुदत्ता । 
                आरती ओंवाळितां हरली भवचिंता ।।धृ०।।
             
                दत्त येऊनिया उभा ठाकला ।
                सद्भावे साष्टांगे प्रणिपात केला ।
                प्रसन्न होऊनी आशिर्वाद दिधला ।
                जन्ममरणाचा फेरा चुकविला ।।३।।
                
                जयदेव जयदेव जय श्रीगुरुदत्ता । 
                आरती ओंवाळितां हरली भवचिंता ।।धृ०।।
             
                'दत्त दत्त' ऐसे लागले ध्यान ।
                हारपले मन झाले उन्मन ।
                मी-तुंपणाची झाली बोळवण ।
                एका जनार्दनी श्रीदत्तध्यान ।।४।।
                
                जयदेव जयदेव जय श्रीगुरुदत्ता । 
                आरती ओंवाळितां हरली भवचिंता ।।धृ०।।
            """.trimIndent()

            "श्रीपाद श्रीवल्लभ जय जय करुणाकर मूर्ती" -> """
                 श्रीपाद श्रीवल्लभ जय जय करुणाकर मूर्ती,
                 जय जय करुणाकर मूर्ती,
                 प्रेम भावे सदानंदे ओवाळू आरती ।।धृ०।।
            
                 पाचाचा देह दयाळा पंचारती जाण
                 दयाळा पंचारती जाण, वाती पंचप्राण
                 त्यामध्ये घालून ।।१।।
                 
                 श्रीपाद श्रीवल्लभ जय जय करुणाकर मूर्ती,
                 जय जय करुणाकर मूर्ती,
                 प्रेम भावे सदानंदे ओवाळू आरती ।।धृ०।।
            
                 ज्ञान शुद्ध घृत भरुनी आरती केली,
                 दयाळा आरती केली,
                 जठाराग्नीं चेतवूनी आरती पाजळली ।।२।।
                 
                 श्रीपाद श्रीवल्लभ जय जय करुणाकर मूर्ती,
                 जय जय करुणाकर मूर्ती,
                 प्रेम भावे सदानंदे ओवाळू आरती ।।धृ०।।
            
                 ओवाळू आरती माझ्या श्रीपाद राया,
                 माझ्या सद्गुरू राया,
                 सत्येंद्र नित्य नेमे सेवीतसे पाया ।।३।।
                 
                 श्रीपाद श्रीवल्लभ जय जय करुणाकर मूर्ती,
                 जय जय करुणाकर मूर्ती,
                 प्रेम भावे सदानंदे ओवाळू आरती ।।धृ०।।
            """.trimIndent()

            "आरती गुरुदत्ता स्वामि सत्येंद्रनाथा" -> """
                 आरती गुरुदत्ता । स्वामि सत्येंद्रनाथा ।
                 पंचप्राण ज्योतिनें । ओंवाळितों समर्था ।।धृ०।।
            
                 सद्गुरु ब्रम्हमूर्ती । स्वप्नीं दाविसी कीर्ती ।
                 मन हें उचंबळलें । प्रेमें कराया आरती ।।१।।
                 
                 आरती गुरुदत्ता । स्वामि सत्येंद्रनाथा ।
                 पंचप्राण ज्योतिनें । ओंवाळितों समर्था ।।धृ०।।
            
                 औदुंबर निमित्त । भक्ति धर्म वाढवाया ।
                 अवतार घेतलासी । दुःखी जन उद्धराया ।।२।।
                 
                 आरती गुरुदत्ता । स्वामि सत्येंद्रनाथा ।
                 पंचप्राण ज्योतिनें । ओंवाळितों समर्था ।।धृ०।।
            
                 भक्तांतरी संदेश । पाठविसी तूं ईश ।
                 दिससी राऊळांत । प्रत्यक्षही कोणास ।।३।।
                 
                 आरती गुरुदत्ता । स्वामि सत्येंद्रनाथा ।
                 पंचप्राण ज्योतिनें । ओंवाळितों समर्था ।।धृ०।।
            
                 सत्याचा इंद्र म्हणुनी । नाम सत्येंद्र साजे ।
                 जनार्दनस्वामी तूझा । लीन चरणीं तुझे ।।४।।
                 
                 आरती गुरुदत्ता । स्वामि सत्येंद्रनाथा ।
                 पंचप्राण ज्योतिनें । ओंवाळितों समर्था ।।धृ०।।
            """.trimIndent()

            "हरिदासस्वामी महाराजांची आरती" -> """
                 आरती सद्गुरू नाथा, हरिदास समर्था ।
                 चरणी मी लीन तुझ्या, भेट सत्वरी आता ।।धृ०।।
            
                 सत्य श्रेष्ठ ज्ञान बोधें, केले आम्हासी पुनीत ।
                 सत्य इश अवतार, कला विद्येचा दातार ।।१।।
                 
                 आरती सद्गुरू नाथा, हरिदास समर्था ।
                 चरणी मी लीन तुझ्या, भेट सत्वरी आता ।।धृ०।।
            
                 हिंदू धर्म कैवारी, प्रगटले भूमीवरी ।
                 वैखरी सत्य वाणी, सांग तसे सत्वरी ।।२।।
                 
                 आरती सद्गुरू नाथा, हरिदास समर्था ।
                 चरणी मी लीन तुझ्या, भेट सत्वरी आता ।।धृ०।।
            
                 महंत मुनी ज्ञान थोर, शिष्य भारती साचार ।
                 तेज पुंज अपरांपार, कली युगी अवतार ।।३।।
                 
                 आरती सद्गुरू नाथा, हरिदास समर्था ।
                 चरणी मी लीन तुझ्या, भेट सत्वरी आता ।।धृ०।।
            
                 सत्य श्रेष्ठ हरिदास, देई ज्ञानामृत आम्हास ।
                 पूर्णानंद दास तुला, करी उद्धार दिनाचा ।।४।।
                 
                 आरती सद्गुरू नाथा, हरिदास समर्था ।
                 चरणी मी लीन तुझ्या, भेट सत्वरी आता ।।धृ०।।
            """.trimIndent()

            "श्रीमत् नृसिंह सरस्वतीस्वामी महाराजांची आरती" -> """
                 कृष्ण पंचगंगा संगम निजस्थान ।
                 चरित्र दावुनि केले गाणगापुरी गमन ।
                 तेथे भक्त श्रेष्ठ त्रिविक्रमयति जाण ।
                 विश्वरूपें तया दिधले दर्शन ।।१।।
            
                 जयदेव जयदेव जय सदगुरुदत्ता
                 नरसिंहसरस्वती जय विश्वंभरिता ।।धृ०।।
            
                 वंध्यासाठी वर्षे पुत्रनिधान ।
                 मृतब्राह्मण उठविला तीर्थ शिंपून ।
                 वांझ महिषी काढवी दुग्ध दोहून ।
                 अंत्यजाचे वदनी निगमागम पूर्ण ।।२।।
                 
                 जयदेव जयदेव जय सदगुरुदत्ता
                 नरसिंहसरस्वती जय विश्वंभरिता ।।धृ०।।
            
                 शुष्क काष्ठी पल्लव दावुनि लवलाही ।
                 कुष्ठी ब्राह्मण केला शुद्ध निजदेही ।
                 अभिनव महिमा त्याची वर्णू मी काई।
                 म्लेंच्छ राजा येऊनि वंदी श्रीपायी ।।३।।
                 
                 जयदेव जयदेव जय सदगुरुदत्ता
                 नरसिंहसरस्वती जय विश्वंभरिता ।।धृ०।।
            
                 दीपावालीचे दिवशी भक्त येऊनि ।
                 आठही जण ठेविती मस्तक श्रीचरणी ।
                 आठही ग्रामी भिक्षा केली ते दिनी ।
                 निमिषमात्रे तंतुक नेला शिवस्थानी ।।४।।
                 
                 जयदेव जयदेव जय सदगुरुदत्ता
                 नरसिंहसरस्वती जय विश्वंभरिता ।।धृ०।।
            
                 ऐसे चरित्र दावुनि जडमूढ उद्धरिले ।
                 भक्तवत्सल ऐसे ब्रीद मिरवीले ।
                 अगाध महिमा म्हणवु वेदश्रुति बोले ।
                 गंगाधर तनय वंदी श्रीपाउलें ।।५।।
                 
                 जयदेव जयदेव जय सदगुरुदत्ता
                 नरसिंहसरस्वती जय विश्वंभरिता ।।धृ०।।
            """.trimIndent()

            "भूपाळी श्रीदत्तात्रेयांची आरती" -> """
                 उठी उघी मुनिवंदना । भक्त पातले दर्शना ।
                 त्यांची पुरवी तूं कामना । पाही नयन उघडुनी ।।धृ०।।
            
                 उघडूनिया करुणादृष्टी । दासा धरी आपले पोटी ।
                 नको येऊ देऊं हिंपुटी । घाली कंठी मिठी हर्षे ।।१।।
            
                 हर्षे तुझे पदी रंगले । दारागारा विसरले ।
                 निजदेहा न भुलले । निवटले निजभावे ।।२।।
            
                 निजभावी येता शरण । लपविसी कां वा चरण ।
                 जेणे तरती दुष्टाचरण । मग मरणभय कैंचे ।।३।।
            
                 नको करू निष्ठुर मन । शीघ्र देई आश्वासन ।
                 तू अससी करुणाधन । तापशमन करि शीघ्र ।।४।।
            
                 उठी उठी बा सद्गुरुराया । उठी उठी करुणालया ।
                 उठी उठी बा चिन्मया । निजमाया आवरी ।।५।।
            """.trimIndent()

            "कांकडे आरती" -> """
                 कांकडे आरती दत्ता तुजला ओवाळू ।
                 प्रेमभावे तुझे चरण हृदयी कवळू ।।धृ०।।
            
                 माया अविद्या एकत्र वळूनी कांकडा केला ।
                 स्वरूपानुस्मरण स्नेहामाजी भिजविला ।।१।।
            
                 विवेकज्ञानाग्निज्वाळेवरि सहसा पाजळिला ।
                 पेटुनिया झगझगीत उजेड हा पडला ।।२।।
            
                 द्वैतध्वांता समूळ ग्रासुनि मनोन्मनी शोभा ।
                 फाकली तेव्हां पळ सुटे कामादिक शलभां ।।३।।
            
                 धावुनि आपोआप येती कामादिक शलभ ।
                 जळती ज्याचा अंत योग्यां दुर्लभ ।।४।।
            
                 कांकडे आरती ऐसी उजळू सोज्वळ ।
                 मी-तूं-पण हे हरपूनि होऊ केवळ ।।५।।
            """.trimIndent()

            "धन्य धन्य हो प्रदक्षिणा" -> """
                धन्य धन्य हो प्रदक्षिणा सद्गुरूरायाची ।
                झाली त्वरा सुरवरा विमान उतरायाची ।।धृ०।।
 
                पदोपदी अपार झाल्या पुण्याच्या राशी ।
                सर्वही तीर्थे घडली अम्हां आदिकरूनि काशी ।।१।।
                
                धन्य धन्य हो प्रदक्षिणा सद्गुरूरायाची ।
                झाली त्वरा सुरवरा विमान उतरायाची ।।धृ०।।
                
                मृदंग-टाळ-ढोल-भक्त भावार्थे गाती ।
                नामसंकीर्तने ब्रह्मानंदे नाचती ।।२।।
                
                धन्य धन्य हो प्रदक्षिणा सद्गुरूरायाची ।
                झाली त्वरा सुरवरा विमान उतरायाची ।।धृ०।।
             
                कोटी ब्रह्महत्या हरिती करिता दंडवत ।
                लोटांगण घालिता मोक्ष लोळे पायात ।।३।।
                
                धन्य धन्य हो प्रदक्षिणा सद्गुरूरायाची ।
                झाली त्वरा सुरवरा विमान उतरायाची ।।धृ०।।
             
                गुरुभजनाचा महिमा न कळे आगमा-निगमांसी ।
                अनुभव ते जाणती जे गुरुपदिंचे रहिवासी ।।४।।
                
                धन्य धन्य हो प्रदक्षिणा सद्गुरूरायाची ।
                झाली त्वरा सुरवरा विमान उतरायाची ।।धृ०।।
             
                प्रदक्षिणा करूनि देह भावे वाहिला ।
                श्रीरंगात्मज विठ्ठल पुढे उभा राहिला ।।५।।
                
                धन्य धन्य हो प्रदक्षिणा सद्गुरूरायाची ।
                झाली त्वरा सुरवरा विमान उतरायाची ।।धृ०।।
            """.trimIndent()

            "येई हो विठ्ठले माझे माउली ये" -> """
                येई हो विठ्ठले माझे माउली ये । 
                निढळावरी कर ठेवुनि वाट मी पाहें ।।धृ०।।
            
                आलिया गेलिया हातीं धाडी निरोप। 
                पंढरपुरी आहे माझा मायबाप ।।१।।
                
                येई हो विठ्ठले माझे माउली ये । 
                निढळावरी कर ठेवुनि वाट मी पाहें ।।धृ०।।
            
                पिवळा पीतांबर कैसा गगनीं झळकला । 
                गरुडावरि बैसोनि माझा कैवारी आला ।।२।।
                
                येई हो विठ्ठले माझे माउली ये । 
                निढळावरी कर ठेवुनि वाट मी पाहें ।।धृ०।।
            
                विठोबाचे राज्य आम्हां नित्य दिपवाळी । 
                विष्णुदास नामा जीवें भावें ओंवाळी ।।३।।
                
                येई हो विठ्ठले माझे माउली ये । 
                निढळावरी कर ठेवुनि वाट मी पाहें ।।धृ०।।
            """.trimIndent()

            "युगे अठ्ठावीस विटेवरी उभा" -> """
                युगे अठ्ठावीस विटेवरी उभा ।
                वामाङ्गी रखुमाईदिसे दिव्य शोभा ।
                पुण्डलिकाचे भेटि परब्रह्म आले गा । 
                चरणी वाहे भीमा उद्धरी जगा ।।१।।
            
                जय देव जय देव जय पांडुरंगा । 
                रखुमाई वल्लभा राईच्या वल्लभा पावे जिवलगा ।।धृ०।।
            
                तुळसीमाळा गळा कर ठेऊनी कटी ।
                कासे पीताम्बर कस्तुरी लल्लाटी । 
                देव सुरवर नित्य येती भेटी ।
                गरुड हनुमन्त पुढे उभे राहती ।।२।।
                
                जय देव जय देव जय पांडुरंगा । 
                रखुमाई वल्लभा राईच्या वल्लभा पावे जिवलगा ।।धृ०।।
            
                धन्य वेणूनाद अणुक्षेत्रपाळा ।
                सुवर्णाची कमळे वनमाळा गळा । 
                राई रखुमाबाई राणीया सकळा ।
                ओवाळिती राजा विठोबा सावळा ।।३।।
                
                जय देव जय देव जय पांडुरंगा । 
                रखुमाई वल्लभा राईच्या वल्लभा पावे जिवलगा ।।धृ०।।
            
                ओवाळू आरत्या कुरवण्ड्या येती ।
                चन्द्रभागेमाजी सोडुनिया देती । 
                दिण्ड्या पताका वैष्णव नाचती ।
                पण्ढरीचा महिमा वर्णावा किती ।।४।।
                
                जय देव जय देव जय पांडुरंगा । 
                रखुमाई वल्लभा राईच्या वल्लभा पावे जिवलगा ।।धृ०।।
            
                आषाढी कार्तिकी भक्तजन येती ।
                चन्द्रभागेमाजी स्नाने जे करिती । 
                दर्शन होळामात्रे तया होय मुक्ति ।
                केशवासी नामदेव भावे ओवाळिती ।।५।।
                
                जय देव जय देव जय पांडुरंगा । 
                रखुमाई वल्लभा राईच्या वल्लभा पावे जिवलगा ।।धृ०।।
            """.trimIndent()

            "आरती साईबाबा" -> """
                आरती साईबाबा । सौख्यदातार जीवा ।
                चरणरजातली । द्यावा दासा विसावा, भक्ता विसावा ।।धृ०।।
                
                जाळुनियां अनंग। स्वस्वरूपी राहेदंग ।
                मुमुक्षूजनां दावी । निज डोळा श्रीरंग ।।१।।
                
                आरती साईबाबा । सौख्यदातार जीवा ।
                चरणरजातली । द्यावा दासा विसावा, भक्ता विसावा ।।धृ०।।
            
                जयामनी जैसा भाव । तया तैसा अनुभव ।
                दाविसी दयाघना । ऐसी तुझीही माव ।।२।।
                
                आरती साईबाबा । सौख्यदातार जीवा ।
                चरणरजातली । द्यावा दासा विसावा, भक्ता विसावा ।।धृ०।।
            
                तुमचे नाम ध्याता । हरे संस्कृती व्यथा ।
                अगाध तव करणी । मार्ग दाविसी अनाथा ।।३।।
                
                आरती साईबाबा । सौख्यदातार जीवा ।
                चरणरजातली । द्यावा दासा विसावा, भक्ता विसावा ।।धृ०।।
            
                कलियुगी अवतार । सगुण परब्रह्मः साचार ।
                अवतीर्ण झालासे । स्वामी दत्त दिगंबर ।।४।।
                
                आरती साईबाबा । सौख्यदातार जीवा ।
                चरणरजातली । द्यावा दासा विसावा, भक्ता विसावा ।।धृ०।।
            
                आठा दिवसा गुरुवारी । भक्त करिती वारी ।
                प्रभुपद पहावया । भवभय निवारी ।।५।।
                
                आरती साईबाबा । सौख्यदातार जीवा ।
                चरणरजातली । द्यावा दासा विसावा, भक्ता विसावा ।।धृ०।।
            
                माझा निजद्रव्यठेवा । तव चरणरज सेवा ।
                मागणे हेचि आता । तुम्हा देवाधिदेवा ।।६।।
                
                आरती साईबाबा । सौख्यदातार जीवा ।
                चरणरजातली । द्यावा दासा विसावा, भक्ता विसावा ।।धृ०।।
            
                इच्छित दिन चातक। निर्मल तोय निजसुख ।
                पाजावे माधवा या । सांभाळ आपुली भाक ।।७।।
                
                आरती साईबाबा । सौख्यदातार जीवा ।
                चरणरजातली । द्यावा दासा विसावा, भक्ता विसावा ।।धृ०।।
            """.trimIndent()

            "श्री सद्गुरू साईबाबांचे भक्तांना अभय" -> """
                 शिर्डीस ज्याचे लागतील पाय । टळती अपाय सर्व त्याचे ।।१।।
                 माझ्या समाधीची पायरी चढेल । दुःख हे हरेल सर्व त्याचे ।।२।।
                 जरी हे शरीर गेलो मी टाकून । तरी मी धावेन भक्तासाठी ।।३।।
                 नवसास माझी पावेल समाधी । धरा दृढ बुद्धि माझ्या ठायी ।।४।।
                 नित्य मी जिवंत, जाणा हेचि सत्य । नित्य घ्या प्रचिती अनुभवे ।।५।।
                 शरण माझे आला, आणि वाया गेला । दाखवा दाखवा ऐसा कोणी? ।।६।।
                 जो जो, मज भजे, जैशा जैशा भावे । तैसा तैसा पावे, मीही त्यासी ।।७।।
                 तुमचा मी भार वाहीन सर्वथा । नव्हे हे अन्यथा वचन माझे ।।८।।
                 जाणा येथे आहे सहाय्य सर्वास । मागे जे जे त्यास ते ते लाभे ।।९।।
                 माझा जो जाहला काया-वाचा-मनी । त्याचा मी ऋणी सर्वकाळ ।।१०।।
                 साई म्हणे तोचि, तोचि झाला धन्य । झाला जो अनन्य माझ्या पायी ।।११।।
            """.trimIndent()

            "घेउनियां पंचारती करूं बाबांसी आरती" -> """
                 घेउनियां पंचारती । करूं बाबांसी आरती ।।
                 करूं साईसी । करूं बाबांसी आरती ।। 1 ।।
            
                 उठा उठा हो बांधव । ओंवाळूं हा रमाधव ।।
                 साई रमाधव । ओंवाळूं हा रमाधव ।। 2 ।।
            
                 करुनीयां स्थीर मन । पाहूं गंभीर हें ध्यान ।।
                 साईचें हें ध्यान । पाहूं गंभीर हें ध्यान ।। 3 ।।
            
                 कृष्णनाथा दत्तसाई । जडो चित्त तुझे पायीं ।।
                 चित्त देवा पायीं । जडो चित्त तुझे पायीं ।। 4 ।।
            """.trimIndent()

            "आरती सद्गुरुनाथा चंद्रशेखर समर्था" -> """
                 आरती सद्गुरुनाथा । चंद्रशेखर समर्था ।।
                 ओंवाळितो प्रेमभावें । चरणीं ठेविला माथा ।।
                 आरती सद्गुरुनाथा ।।धृ०।।
            
                 धन्य धन्य तुझी मूर्ती । दर्शनें पाप ताप हरती ।।
                 हस्त मस्तकीं पडतां । द्वैत भाव मावळती ।।१।।
                 
                 आरती सद्गुरुनाथा । चंद्रशेखर समर्था ।।
                 ओंवाळितो प्रेमभावें । चरणीं ठेविला माथा ।।
                 आरती सद्गुरुनाथा ।।धृ०।।
            
                 पाजोनिया बोधामृत । केलें अज्ञाना-रहित ।।
                 चेतवोनी ज्ञान ज्योत । आम्हां केलें त्वां पुनीत ।।२।।
                 
                 आरती सद्गुरुनाथा । चंद्रशेखर समर्था ।।
                 ओंवाळितो प्रेमभावें । चरणीं ठेविला माथा ।।
                 आरती सद्गुरुनाथा ।।धृ०।।
            
                 अज्ञानी जन सारे । घोर संसार सागरीं ।।
                 भक्ति-विमुख झालें । दृष्ट कर्मे आचरोनीं ।।३।।
                 
                 आरती सद्गुरुनाथा । चंद्रशेखर समर्था ।।
                 ओंवाळितो प्रेमभावें । चरणीं ठेविला माथा ।।
                 आरती सद्गुरुनाथा ।।धृ०।।
            
                 जाणोनिया कली-भाव । अवतरलाशी तूं केशव ।।
                 सत्यश्रेष्ठ धर्म पंथें । मार्गे लावीले जीव ।।४।।
                 
                 आरती सद्गुरुनाथा । चंद्रशेखर समर्था ।।
                 ओंवाळितो प्रेमभावें । चरणीं ठेविला माथा ।।
                 आरती सद्गुरुनाथा ।।धृ०।।
            
                 जाणोनिया शुद्ध भाव । सत्य दावीला देव ।।
                 सत्येंद्र पदीं लागे । पायीं ठेवोनी भाव ।।५।।
                 
                 आरती सद्गुरुनाथा । चंद्रशेखर समर्था ।।
                 ओंवाळितो प्रेमभावें । चरणीं ठेविला माथा ।।
                 आरती सद्गुरुनाथा ।।धृ०।।
            """.trimIndent()

            "ओवाळू आरती सद्गुरु राया" -> """
                 ओवाळू आरती सद्गुरु राया ।
                 सत्येंद्रनाथा स्वामि शरण तव पाया ।।धृ०।।
            
                 कांसे पितांबर शोभती सुंदर ते चरण ।
                 गोरवर्ण शोभे आंगी देदीप्यमान ।।१।।
                 
                 ओवाळू आरती सद्गुरु राया ।
                 सत्येंद्रनाथा स्वामि शरण तव पाया ।।धृ०।।
            
                 पुष्पांचे ते हार गळां रूद्राक्ष माळा ।
                 मुखमंडळ विलसे भाळीं चंदन चंद्रकळा ।।२।।
                 
                 ओवाळू आरती सद्गुरु राया ।
                 सत्येंद्रनाथा स्वामि शरण तव पाया ।।धृ०।।
            
                 भक्तमनीं संकल्प होती अंतरीं ओळखिसी ।
                 भेटीं होतां कृपें तयांचे समाधान करिसी ।।३।।
                 
                 ओवाळू आरती सद्गुरु राया ।
                 सत्येंद्रनाथा स्वामि शरण तव पाया ।।धृ०।।
            
                 परमार्थाचा सद्गुरु राजा देव एक मूळीं ।
                 स्वामी जनार्दन प्रेमभावें तुजला ओंवाळी ।।४।।
                 
                 ओवाळू आरती सद्गुरु राया ।
                 सत्येंद्रनाथा स्वामि शरण तव पाया ।।धृ०।।
            """.trimIndent()

            "आरती ज्ञानराजा" -> """
                आरती ज्ञानराजा ।
                महाकैवल्यतेजा ।
                सेविती साधुसंत ।
                मनु वेधला माझा ।।धृ०।।
            
                लोपलें ज्ञान जगी ।
                हित नेणती कोणी ।
                अवतार पांडुरंग ।
                नाम ठेविले ज्ञानी ।।१।।
                
                आरती ज्ञानराजा ।
                महाकैवल्यतेजा ।
                सेविती साधुसंत ।
                मनु वेधला माझा ।।धृ०।।
            
                कनकाचे ताट करी ।
                उभ्या गोपिका नारी ।
                नारद तुंबर हो ।
                साम गायन करी ।।२।।
                
                आरती ज्ञानराजा ।
                महाकैवल्यतेजा ।
                सेविती साधुसंत ।
                मनु वेधला माझा ।।धृ०।।
            
                प्रकट गुह्य बोले ।
                विश्र्व ब्रम्हाची केलें ।
                रामजनार्दनी ।
                पायी मस्तक ठेविले ।।३।।
                
                आरती ज्ञानराजा ।
                महाकैवल्यतेजा ।
                सेविती साधुसंत ।
                मनु वेधला माझा ।।धृ०।।
            """.trimIndent()

            "जय जय जगतम हरणा" -> """
                 जय जय जगतम हरणा दिनकर सुखकिरणा ।
                 उदयाचल जगभासक दिनमणि शुभस्मरणा ।
                 पद्मासन सुखमूर्ती सुहास्य वरवदना ।
                 पद्माकर वरदप्रभ भास्वत सुखसदना ।।१।।
            
                 जय देव जय देव जय भास्कर सूर्या ।
                 विधिहरि शंकररूपा जय सुरवरवर्गा ।।धृ०।।
            
                 कनकाकृतिरथ एकचक्रांकित तरणी ।
                 सप्ताननाश्वभूषित रथिं त्या बैसोनी ।
                 योजनसहस्र द्वे द्वे शतयोजन दोन्ही ।
                 निमिषार्धे जग क्रमिसी अद्भुत तव करणी ।।२।।
                 
                 जय देव जय देव जय भास्कर सूर्या ।
                 विधिहरि शंकररूपा जय सुरवरवर्गा ।।धृ०।।
            
                 जगदुद्भवस्थिति प्रलय कवणाद्य-रूपा ।
                 ब्रह्म परात्पर पूर्ण तूं अद्वय तद्रूपा ।
                 तत्त्वंपदव्यतिरिक्ता अखंड सुखरूपा ।
                 अनन्य तव पद मौनी वंदित चिद्रूपा ।।३।।
                 
                 जय देव जय देव जय भास्कर सूर्या ।
                 विधिहरि शंकररूपा जय सुरवरवर्गा ।।धृ०।।
            """.trimIndent()

            "आरती सप्रेम जय जय विठ्ठल परब्रह्म" -> """
                आरती सप्रेम जय जय विठ्ठल परब्रह्म । 
                भक्त संकटिं नाना स्वरूपीं स्थापिसि स्वधर्म ।।धृ०।।
             
                अंबऋषीकारणें गर्भवास सोशीसी । 
                वेद नेले चोरूनि ब्रह्मया आणुनियां देसी ।।
                मत्स्यरूपी नारायण सप्तहि सागर धुंडीसी । 
                हस्त लागतां शंखासुरा तुझा वर देसी ।।१।।
                
                आरती सप्रेम जय जय विठ्ठल परब्रह्म । 
                भक्त संकटिं नाना स्वरूपीं स्थापिसि स्वधर्म ।।धृ०।।
             
                रसातळासी जातां पृथ्वी पाठीवर घेसी । 
                परोपकरासाठीं देवा कांसव झालासी ।।
                दाढें धरुनी पृथ्वी नेतां वराहरूप होसी । 
                प्रल्हादाकारणें स्तंभीं नरहरि गुरगुरसी ।।२।।
                
                आरती सप्रेम जय जय विठ्ठल परब्रह्म । 
                भक्त संकटिं नाना स्वरूपीं स्थापिसि स्वधर्म ।।धृ०।।
             
                पांचवे अवतारीं बळिच्या द्वाराला जासी । 
                भिक्षे स्थळ मागुनीं बळीला पाताळा नेसी ।।
                सर्व समर्पण केलं म्हणुनी प्रसन्न त्या होसी । 
                वामनरूप धरुनी बळिच्या द्वारीं तिष्ठसी ।।३।।
                
                आरती सप्रेम जय जय विठ्ठल परब्रह्म । 
                भक्त संकटिं नाना स्वरूपीं स्थापिसि स्वधर्म ।।धृ०।।
             
                सहस्त्रार्जुन मातला जमदग्नीचा वध केला । 
                कष्टी ते रेणुका म्हणुनी सहस्त्रार्जुन वधिला ।।
                निःक्षत्री पृथ्वी दान दिधली विप्राला । 
                सहावा अवतार परशुराम प्रगटला ।।४।।
                
                आरती सप्रेम जय जय विठ्ठल परब्रह्म । 
                भक्त संकटिं नाना स्वरूपीं स्थापिसि स्वधर्म ।।धृ०।।
             
                मातला रावण सर्वां उपद्रव केला । 
                तेहतिस कोटी देव बंदी हरिलें सीतेला ।।
                पितृवचनालागीं रामें वनवास केला । 
                मिळोनि वानरसहित राजा राम प्रगटला ।।५।।
                
                आरती सप्रेम जय जय विठ्ठल परब्रह्म । 
                भक्त संकटिं नाना स्वरूपीं स्थापिसि स्वधर्म ।।धृ०।।
             
                देवकीवसुदेवबंदीमोचन त्वां केलें । 
                नंदाघरीं जाउनी निजसुख गोकुळा दिधलें ।।
                गोरसचोरी करितां नवलक्ष गोपाळ मिळविले । 
                गोपिकांचें प्रेम देखुनि श्रीकृष्ण भुलले ।।६।।
                
                आरती सप्रेम जय जय विठ्ठल परब्रह्म । 
                भक्त संकटिं नाना स्वरूपीं स्थापिसि स्वधर्म ।।धृ०।।
             
                बौद्ध कलंकी कलियुगीं झाला अधर्म हा अवघा । 
                सोडुनी दिधला धर्म म्हणुनी न दिससी देवा ।।
                म्लेंच्छमर्दन करिसी ह्मणोनि कलंकी केशवा । 
                बहिरवि जान्हवी द्यावी निजसुखानंदाची सेवा ।।७।।
                
                आरती सप्रेम जय जय विठ्ठल परब्रह्म । 
                भक्त संकटिं नाना स्वरूपीं स्थापिसि स्वधर्म ।।धृ०।।
            """.trimIndent()

            "घालीन लोटांगण" -> """
                घालीन लोटांगण, वंदीन चरण । डोळ्यांनी पाहीन रुप तुझें ।  
                प्रेमें आलिंगन, आनंदे पूजिन । भावें ओवाळीन म्हणे नामा ।। 
            
                त्वमेव माता च पिता त्वमेव । त्वमेव बंधुक्ष्च सखा त्वमेव । 
                त्वमेव विध्या द्रविणं त्वमेव । त्वमेव सर्वं मम देवदेव ।। 
            
                कायेन वाचा मनसेंद्रीयेव्रा । बुद्धयात्मना वा प्रकृतिस्वभावात । 
                करोमि यध्य्त सकलं परस्मे । नारायणायेति समर्पयामि ।।
            
                अच्युतं केशवं रामनारायणं । कृष्णदामोदरं वासुदेवं हरिम ।
                श्रीधरं माधवं गोपिकावल्लभं । जानकीनायकं रामचंद्र भजे ।।
            
                हरे राम हर राम, राम राम हरे हरे । हरे कृष्ण हरे कृष्ण, कृष्ण कृष्ण हरे हरे ।।
            """.trimIndent()

            "मंत्रपुष्पांजली" -> """
                ॐ यज्ञेन यज्ञमयजन्त देवास्तनि धर्माणि प्रथमान्यासन् । 
                ते ह नाकं महिमान : सचंत यत्र पूर्वे साध्या : संति देवा : ।। 
            
                ॐ राजाधिराजाय प्रसह्य साहिने । 
                नमो वयं वैश्रवणाय कुर्महे । 
                स मस कामान् काम कामाय मह्यं। 
                कामेश्र्वरो वैश्रवणो ददातु कुबेराय वैश्रवणाय । 
                महाराजाय नम: । 
            
                ॐ स्वस्ति। साम्राज्यं भौज्यं स्वाराज्यं 
                वैराज्यं पारमेष्ठ्यं राज्यं महाराज्यमाधिपत्यमयं 
                वैराज्यं पारमेष्ठ्यं राज्यं महाराज्यमाधिपत्यमयं 
                समंतपर्यायीस्यात् सार्वभैम: सार्वायुष आं 
                तादापरार्धात् पृथिव्यै समुद्रपर्यंताया एकेराळिति 
                तदप्येष: श्लोको भिगीतो मरूत: परिवेष्टारो 
                मरूतस्यावसन् गृहे । 
                आविक्षितस्य कामप्रेर्विश्र्वेदेवा: सभासद इति ।। 
                 
                एकदंतायविघ्महे वक्रतुण्डाय धीमहि । 
                तन्नोदंती प्रचोदयात् ।
            """.trimIndent()

            "निरोप गीत" -> """
                 जाहलें भजन आम्ही नमितों तव चरणां ।
                 वारूनियां विघ्ने देवा रक्षावें दीनां ।।धृ०।।
            
                 दास तुझे आम्ही देवा तुजलाची ध्यातों ।
                 प्रेमेंकरूनी देवा तुझे गूण गातो ।।१।।
            
                 तरी न्यावी सिद्धि देवा हेचि वासना ।
                 रक्षुनीयां सर्वां द्यावी आम्हांसी आज्ञा ।।२।।
            
                 मागणें तें देवा आतां एकचि आहे ।
                 तारूनियां सकळां आम्हां कृपा दृष्टीं पाहें ।।३।।
            
                 जेव्हां सर्व आम्हीं मिळूं ऐशा या ठाया ।
                 प्रेमानंदें लागूं तुझी कीर्ति गाया ।।४।।
            
                 सदा ऐसी भक्ती राहो आमुच्या मनीं ।
                 हेचि देवा तुम्हां असे नित्य विनवणी ।।५।।
            
                 निर्दाळूनी अरिष्टें आतां आमुचीं सारीं ।
                 कृपेची साउली देवा दीनांवरी करी ।।६।।
            
                 निरंतर आमुची चिंता तुम्हां असावी ।
                 आम्हां सर्वांची लज्जा देवा तुम्हीं रक्षावी ।।७।।
            
                 निरोप घेतों आतां आम्हां आज्ञा असावी ।
                 चुकलें आमचें कांहीं त्याची क्षमा असावी ।।८।।
            """.trimIndent()

            "पसायदान" -> """
                आतां विश्वात्मके देवे, येणे वाग्यज्ञे तोषावे, 
                तोषोनि मज द्यावे, पसायदान हे ।।१।। 
             
                जे खळांचि व्यंकटी सांडो, तया सत्कर्मी रती वाढो, 
                भूतां परस्परे जडो, मैत्र जीवांचे ।।२।। 
             
                दुरितांचे तिमिर जावो, विश्व स्वधर्म सूर्ये पाहो, 
                जो जे वांछील तो ते लाहो, प्राणिजात ।।३।। 
             
                वर्षत सकळ मंडळी, ईश्वरनिष्ठांची मांदियाळी, 
                अनवरत भूमंडळी, भेटतु भूता ।।४।। 
             
                चला कल्पतरूंचे आरव, चेतनाचिंतामणींचे गाव, 
                बोलती जे अर्णव, पीयूषांचे ।।५।।
             
                चन्द्रमेंजे अलांछन, मार्तण्ड जे तापहीन, 
                ते सर्वाही सदा सज्जन, सोयरे होतु ।।६।।
             
                किंबहुना सर्व सुखी, पूर्ण होवोनि तिहीं लोकी, 
                भजिजो आदिपुरुषीं, अखण्डित ।।७।। 
             
                आणि ग्रंथोपजिवीये, विशेषी लोकी इये, 
                दृष्टादृष्टविजये, होआवेजी ।।८।।
             
                येथ म्हणे श्री विश्वेश्वरावो, हा होईल दानपसावो, 
                येणे वरे ज्ञानदेवो, सुखिया झाला ।।९।।
            """.trimIndent()

            else -> "Lyrics coming soon..."
        }
    }
}